Table of Contents
 Class GrpcReflectionServer
Namespace
IdeaStatiCa.Plugin.Grpc.Reflection
Assembly
IdeaStatiCa.Plugin.dll
Instance of GrpcServer with Reflection Service added.
public class GrpcReflectionServer : GrpcServer, IGrpcServer, IGrpcCommunicator
Inheritance
object
GrpcServer
GrpcReflectionServer
Implements
IGrpcServer
IGrpcCommunicator
Inherited Members
 GrpcServer.Logger
 GrpcServer.Port
 GrpcServer.Host
 GrpcServer.ClientID
 GrpcServer.GrpcService
 GrpcServer.StartAsync(string, int)
 GrpcServer.StopAsync()
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 GrpcReflectionServer(object, IPluginLogger, IBlobStorageProvider, int, int)
Creates a grpc reflection service for specified instance.
public GrpcReflectionServer(object instance, IPluginLogger logger, IBlobStorageProvider blobStorageProvider, int maxDataLength = 104857600, int chunkSize = 65536)
Parameters
instance object
Instance targeted by reflection calls.
logger IPluginLogger
pluginLogger
blobStorageProvider IBlobStorageProvider
Provider of blob storages
maxDataLength int
The maximal size of GrpcMessage.data in bytes in grpc message
chunkSize int
Size of one chunk in bytes for blob storage data transferring
 Edit this page